; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v9 ?v13)
             (pred_7 ?v1 ?v12)
             (pred_6 ?v9 ?v12)
             (pred_2 ?v6 ?v9 )
	     (pred_11 ?v9)
             (pred_3 ?v8)
             (pred_9 ?v1)
             (pred_10 ?v12)
             (pred_4 ?v9)
             (pred_12 ?v1)
             (pred_1 ?v9)
             (pred_5 ))



(:action op_1
:parameters (?v5 ?v11 ?v4 ?v2)
:precondition (and (pred_3 ?v5) (pred_3 ?v11) (pred_9 ?v4) (pred_10 ?v2)
          (pred_8 ?v5 ?v11) (pred_7 ?v4 ?v2)
                   (pred_6 ?v11 ?v2) (pred_11 ?v5) 
                   (pred_4 ?v11) (pred_12 ?v4))
:effect (and  (pred_1 ?v11) (not (pred_4 ?v11))))


(:action op_3
:parameters (?v5 ?v7)
:precondition (and (pred_3 ?v5) (pred_3 ?v7)
               (pred_11 ?v5) (pred_8 ?v5 ?v7) (pred_1 ?v7))
:effect (and (pred_11 ?v7) (not (pred_11 ?v5))))

(:action op_5
:parameters (?v5 ?v4)
:precondition (and (pred_3 ?v5) (pred_9 ?v4) 
                  (pred_11 ?v5) (pred_2 ?v4 ?v5) (pred_5 ))
:effect (and (pred_12 ?v4)
   (not (pred_2 ?v4 ?v5)) (not (pred_5 ))))


(:action op_2
:parameters (?v5 ?v3 ?v10)
:precondition (and (pred_3 ?v5) (pred_9 ?v3) (pred_9 ?v10)
                  (pred_11 ?v5) (pred_12 ?v10) (pred_2 ?v3 ?v5))
:effect (and (pred_12 ?v3) (pred_2 ?v10 ?v5)
        (not (pred_12 ?v10)) (not (pred_2 ?v3 ?v5))))

(:action op_4
:parameters (?v5 ?v4)
:precondition (and (pred_3 ?v5) (pred_9 ?v4) 
                  (pred_11 ?v5) (pred_12 ?v4))
:effect (and (pred_5 ) (pred_2 ?v4 ?v5) (not (pred_12 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_01 obj_08 obj_13 obj_21 obj_10 obj_17 obj_07 obj_03 obj_20 obj_12 obj_05 obj_06 obj_11 obj_19 obj_02
    obj_15 obj_18
    obj_16 obj_14 obj_04
    )

    (:init
       (pred_5)

       (pred_3 obj_09)
       (pred_3 obj_01)
       (pred_3 obj_08)
       (pred_3 obj_13)
       (pred_3 obj_21)
       (pred_3 obj_10)
       (pred_3 obj_17)
       (pred_3 obj_07)
       (pred_3 obj_03)
       (pred_3 obj_20)
       (pred_3 obj_12)
       (pred_3 obj_05)
       (pred_3 obj_06)
       (pred_3 obj_11)
       (pred_3 obj_19)
       (pred_3 obj_02)
       (pred_10 obj_15)
       (pred_10 obj_18)
       (pred_9 obj_16)
       (pred_9 obj_14)
       (pred_9 obj_04)

       (pred_8 obj_09 obj_21)
       (pred_8 obj_09 obj_01)
       (pred_8 obj_01 obj_10)
       (pred_8 obj_01 obj_08)
       (pred_8 obj_01 obj_09)
       (pred_8 obj_08 obj_17)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_08 obj_01)
       (pred_8 obj_13 obj_07)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_21 obj_10)
       (pred_8 obj_21 obj_09)
       (pred_8 obj_10 obj_20)
       (pred_8 obj_10 obj_17)
       (pred_8 obj_10 obj_01)
       (pred_8 obj_10 obj_21)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_17 obj_07)
       (pred_8 obj_17 obj_08)
       (pred_8 obj_17 obj_10)
       (pred_8 obj_07 obj_05)
       (pred_8 obj_07 obj_13)
       (pred_8 obj_07 obj_17)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_03 obj_20)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_20 obj_10)
       (pred_8 obj_20 obj_03)
       (pred_8 obj_12 obj_19)
       (pred_8 obj_12 obj_05)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_05 obj_02)
       (pred_8 obj_05 obj_07)
       (pred_8 obj_05 obj_12)
       (pred_8 obj_06 obj_11)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_11 obj_19)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_11 obj_06)
       (pred_8 obj_19 obj_02)
       (pred_8 obj_19 obj_12)
       (pred_8 obj_19 obj_11)
       (pred_8 obj_02 obj_05)
       (pred_8 obj_02 obj_19)
       (pred_4 obj_19)
       (pred_4 obj_13)
       (pred_4 obj_03)
       (pred_6  obj_19 obj_15)
       (pred_6  obj_13 obj_18)
       (pred_6  obj_03 obj_18)
       (pred_1 obj_09)
       (pred_1 obj_01)
       (pred_1 obj_08)
       (pred_1 obj_21)
       (pred_1 obj_10)
       (pred_1 obj_17)
       (pred_1 obj_07)
       (pred_1 obj_20)
       (pred_1 obj_12)
       (pred_1 obj_05)
       (pred_1 obj_06)
       (pred_1 obj_11)
       (pred_1 obj_02)

       (pred_7  obj_16 obj_15)
       (pred_7  obj_14 obj_18)
       (pred_7  obj_04 obj_18)
       (pred_2 obj_16 obj_12)
       (pred_2 obj_14 obj_06)
       (pred_2 obj_04 obj_10)
       (pred_11 obj_09)
    )

    (:goal (and
       (pred_2 obj_16 obj_06)
       (pred_2 obj_04 obj_02)
    ))
(:constraints
  (always (not (pred_11 obj_17)))
)
)

; plan
1. (op_3 obj_09 obj_21)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_21)
   goals met: 0 of 2
2. (op_3 obj_21 obj_10)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_10)
   goals met: 0 of 2
3. (op_3 obj_10 obj_20)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_20)
   goals met: 0 of 2
4. (op_3 obj_20 obj_12)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_12)
   goals met: 0 of 2
5. (op_5 obj_12 obj_16)
   deleted: (pred_2 obj_16 obj_12) (pred_5)
   added: (pred_12 obj_16)
   goals met: 0 of 2
6. (op_3 obj_12 obj_20)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_20)
   goals met: 0 of 2
7. (op_3 obj_20 obj_11)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_11)
   goals met: 0 of 2
8. (op_1 obj_11 obj_19 obj_16 obj_15)
   deleted: (pred_4 obj_19)
   added: (pred_1 obj_19)
   goals met: 0 of 2
9. (op_3 obj_11 obj_06)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_06)
   goals met: 0 of 2
10. (op_4 obj_06 obj_16)
   deleted: (pred_12 obj_16)
   added: (pred_5) (pred_2 obj_16 obj_06)
   goals met: 1 of 2
11. (op_3 obj_06 obj_11)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_11)
   goals met: 1 of 2
12. (op_3 obj_11 obj_20)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_20)
   goals met: 1 of 2
13. (op_3 obj_20 obj_10)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_10)
   goals met: 1 of 2
14. (op_5 obj_10 obj_04)
   deleted: (pred_2 obj_04 obj_10) (pred_5)
   added: (pred_12 obj_04)
   goals met: 1 of 2
15. (op_3 obj_10 obj_20)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_20)
   goals met: 1 of 2
16. (op_3 obj_20 obj_12)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_12)
   goals met: 1 of 2
17. (op_3 obj_12 obj_05)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_05)
   goals met: 1 of 2
18. (op_3 obj_05 obj_02)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_02)
   goals met: 1 of 2
19. (op_4 obj_02 obj_04)
   deleted: (pred_12 obj_04)
   added: (pred_5) (pred_2 obj_04 obj_02)
   goals met: 2 of 2
